/* error dialog default title */
TIME_MACHINE_ERROR = "Time Machine kunne ikke fullføre sikkerhetskopieringen.";

/* error dialog buttons */
OK = "OK";
PREFERENCES = "Åpne Time Machine-valgpanelet…";

/* string which is shown instead of the _SHOWPREFS message for managed prefs configurations */
MANAGED_PREFS = "Time Machine-innstillinger på denne maskinen styres av Administrerte valg – kontakt systemadministratoren.";

/* error messages - shared with TMPref pane*/

// NO_ERROR
RESULTCODE_0_MESSAGE = "Ingen feil.";

// BACKUP_FAILED_LAUNCH
RESULTCODE_1_MESSAGE = "Kunne ikke starte Time Machine.";  

// BACKUP_FAILED_SETUP
RESULTCODE_2_MESSAGE = "Kan ikke fullføre sikkerhetskopieringen. Det oppsto en feil under opprettelse av sikkerhetskopimappen."; 

// BACKUP_FAILED_TARGETVOL_UNSUPPORTED_FS
RESULTCODE_3_MESSAGE = "Sikkerhetskopidisken har ikke det påkrevde formatet Mac OS Extended (journalført).\n\n%@"; 
RESULTCODE_3_SHOWPREFS = "Åpne Time Machine-valgpanelet for å velge en annen sikkerhetskopidisk.";

// BACKUP_FAILED_TARGETVOL_STATFS_FAILED
RESULTCODE_4_MESSAGE = "Kan ikke hente status for sikkerhetskopidisken."; 

// BACKUP_FAILED_TARGETVOL_OWNERS_DISABLED
RESULTCODE_5_MESSAGE = "Eierskap er ikke aktivert på sikkerhetskopidisken. Eierskap må være aktivert for å bruke denne disken til Time Machine-sikkerhetskopiering.\n\n%@"; 
RESULTCODE_5_SHOWPREFS = "Åpne Time Machine-valgpanelet for å velge en annen sikkerhetskopidisk.";

// BACKUP_FAILED_TARGETVOL_NOT_JOURNALED
RESULTCODE_6_MESSAGE = "Sikkerhetskopidisken har ikke det påkrevde formatet Mac OS Extended (journalført).\n\n%@";
RESULTCODE_6_SHOWPREFS = "Åpne Time Machine-valgpanelet for å velge en annen sikkerhetskopidisk."; 

// BACKUP_FAILED_TARGETVOL_DISK_SPACE
RESULTCODE_7_MESSAGE = "Denne sikkerhetskopien er for stor for sikkerhetskopidisken. Sikkerhetskopien krever %@, men kun %@ er tilgjengelig.\n\n%@";
RESULTCODE_7_SHOWPREFS = "Time Machine trenger arbeidsplass på sikkerhetskopidisken i tillegg til plassen som kreves for sikkerhetskopieringen. Åpne Time Machine-valgpanelet for å velge en større sikkerhetskopidisk, eller gjør sikkerhetskopien mindre ved å utelate filer."; 

// BACKUP_FAILED_TARGETVOL_READONLY
RESULTCODE_8_MESSAGE = "Filer kan ikke kopieres til sikkerhetskopidisken fordi den ser ut til å være «kun lese».\n\n%@";
RESULTCODE_8_SHOWPREFS = "Det er mulig du må reparere eller reformatere disken ved hjelp av Diskverktøy. Hvis disken ikke kan repareres, må du bruke en annen disk til sikkerhetskopiering. Åpne Time Machine-valgpanelet hvis du vil velge en annen sikkerhetskopidisk."; 

// BACKUP_FAILED_TARGETVOL_ACLS_DISABLED
RESULTCODE_9_MESSAGE = "Tilgangskontrollister kreves og er ikke aktivert på sikkerhetskopieringsvolumet.\n\n%@";
RESULTCODE_9_SHOWPREFS = "Åpne Time Machine-valgpanelet for å velge en annen sikkerhetskopidisk."; 

// BACKUP_FAILED_PREFLIGHT_STAGE
RESULTCODE_10_MESSAGE = "Det oppsto en feil under forberedelser til sikkerhetskopiering."; 

// BACKUP_FAILED_COPY_STAGE
RESULTCODE_11_HEADER = "Sikkerhetskopieringen ble ikke utført fordi det oppsto en feil under kopiering av filer til sikkerhetskopidisken.";
RESULTCODE_11_MESSAGE = "Dette kan være et forbigående problem. Prøv igjen senere. Hvis problemet vedvarer, reparerer du sikkerhetskopidisken ved hjelp av Diskverktøy.";

// BACKUP_FAILED_LINK_SOURCE
RESULTCODE_12_MESSAGE = "Det oppsto en feil under kobling av filer på sikkerhetskopidisken."; 

//  BACKUP_FAILED_TOO_MUCH_ACTIVITY
RESULTCODE_13_MESSAGE = "For mange filer ble endret under sikkerhetskopieringen."; 

// BACKUP_FAILED_SNAPSHOT_DELETE_FAILED 
RESULTCODE_14_MESSAGE = "Det oppsto en feil under forsøk på å fjerne utløpte sikkerhetskopier fra sikkerhetskopidisken.";

// BACKUP_FAILED_CULLING_DISABLED
RESULTCODE_15_MESSAGE = "Alle utgåtte sikkerhetskopier er fjernet, men sikkerhetskopidisken er fortsatt full.\n\n%@";
RESULTCODE_15_SHOWPREFS = "Åpne Time Machine-valgpanelet for å velge en større sikkerhetskopidisk.";

// BACKUP_FAILED_CULLING_DATELIMIT
RESULTCODE_16_MESSAGE = "Alle utgåtte sikkerhetskopier er fjernet, men sikkerhetskopidisken er fortsatt full.\n\n%@";
RESULTCODE_16_SHOWPREFS = "Åpne Time Machine-valgpanelet for å velge en større sikkerhetskopidisk."; 

// BACKUP_FAILED_TARGETVOL_NOT_SPECIFIED
RESULTCODE_17_MESSAGE = "Sikkerhetskopidisk er ikke valgt.\n\n%@";
RESULTCODE_17_SHOWPREFS = "Åpne Time Machine-valgpanelet for å velge en sikkerhetskopidisk.";

// BACKUP_FAILED_TARGETVOL_NOT_FOUND
RESULTCODE_18_MESSAGE = "Sikkerhetskopidisken ble ikke funnet.\n\n%@";
RESULTCODE_18_SHOWPREFS = "Forsikre deg om at sikkerhetskopidisken er koblet til, eller åpne Time Machine-valgpanelet for å velge en annen sikkerhetskopidisk."; 

// BACKUP_FAILED_TARGETVOL_NOT_MOUNTED
RESULTCODE_19_MESSAGE = "Sikkerhetskopidisken er ikke tilgjengelig."; 

// BACKUP_FAILED_DISK_IMAGE_NOT_CREATED
RESULTCODE_20_MESSAGE = "Sikkerhetskopidiskfilen «%@» kunne ikke opprettes (feil %@)."; 

// BACKUP_FAILED_DISK_IMAGE_NOT_MOUNTED
RESULTCODE_21_MESSAGE = "Fikk ikke tilgang til sikkerhetskopidiskfilen «%@» (feil %@)."; 

// BACKUP_CANCELED
RESULTCODE_22_MESSAGE = "Sikkerhetskopiering avbrutt."; 

// BACKUP_FAILED_CASE_SENSITIVITY
RESULTCODE_23_MESSAGE = "En disk du sikkerhetskopierer, skiller mellom store og små bokstaver. Sikkerhetskopidisken gjør det ikke.\n\n%@";
RESULTCODE_23_SHOWPREFS = "Åpne Time Machine-valgpanelet for å velge en annen sikkerhetskopidisk eller velge å ikke sikkerhetskopiere disken som skiller mellom små og store bokstaver."; 

// BACKUP_FAILED_DUPLICATE_VOLNAMES
RESULTCODE_24_MESSAGE = "To av diskene som skal sikkerhetskopieres, har samme navn. Endre navnet på en av dem."; 

// BACKUP_FAILED_NO_SOURCE_VOLUMES
RESULTCODE_25_MESSAGE = "Ingen disker er tilgjengelig for sikkerhetskopiering. Dette kan skje hvis alle disker er i «Ikke sikkerhetskopier»-listen.\n\n%@";
RESULTCODE_25_SHOWPREFS = "Hvis du vil gjøre endringer i listen, åpner du Time Machine-valgpanelet og klikker på Valg.";

// BACKUP_FAILED_NETWORK_INTERRUPTION
RESULTCODE_26_HEADER = "Time Machine kunne ikke fullføre sikkerhetskopieringen på grunn av et nettverksproblem.";
RESULTCODE_26_MESSAGE = "Forsikre deg om at datamaskinen og sikkerhetskopidisken er på samme nettverk, og at sikkerhetskopidisken er slått på. Deretter prøver du å sikkerhetskopiere på nytt.";

// BACKUP_FAILED_DISK_INTERRUPTION
RESULTCODE_27_MESSAGE = "Sikkerhetskopidisken kan ha blitt matet ut eller koblet fra maskinen.";

// BACKUP_FAILED_TARGETVOL_DISK_SPACE_DURING_BACKUP
RESULTCODE_28_MESSAGE = "Sikkerhetskopidisken har uventet gått tom for plass. Time Machine vil forsøke å frigjøre mer plass ved å fjerne utløpte sikkerhetskopier ved neste planlagte sikkerhetskopiering.\n\n%@";
RESULTCODE_28_SHOWPREFS = "Åpne Time Machine-valgpanelet for å velge en større sikkerhetskopidisk, eller gjør sikkerhetskopien mindre ved å utelate filer."; 

// BACKUP_FAILED_AUTHENTICATION_ERROR
RESULTCODE_29_MESSAGE = "Fikk ikke tilgang til nettverkssikkerhetskopidisken fordi det oppsto et problem med nettverksbrukernavnet eller -passordet.\n\n%@";
RESULTCODE_29_SHOWPREFS = "Åpne Time Machine-valgpanelet for å velge nettverkssikkerhetskopidisken, og oppgi riktig brukernavn og passord på nytt.";

// BACKUP_FAILED_UNABLE_TO_REUSE_BACKUP
RESULTCODE_30_MESSAGE = "Det oppsto en feil under forsøk på å bruke sikkerhetskopien «%@» på nytt.";

// BACKUP_FAILED_DISK_IMAGE_BUSY
RESULTCODE_31_MESSAGE = "Sikkerhetskopidiskfilen «%@» er allerede i bruk.";

// BACKUP_FAILED_DISK_IMAGE_NOT_FOUND
RESULTCODE_32_MESSAGE = "Sikkerhetskopidiskfilen «%@» ble ikke funnet.";

// BACKUP_FAILED_CLOCK_WRONG
RESULTCODE_33_MESSAGE = "Dato og klokkeslett på maskinen er feil.";

// BACKUP_FAILED_NO_PRIMARY_NETWORK_INTERFACE
RESULTCODE_34_MESSAGE = "Maskinen har ikke et primært nettverksgrensesnitt.";

// BACKUP_FAILED_BOOT_COOKIE_NOT_FOUND
RESULTCODE_35_MESSAGE = "Time Machine fant ikke enkelte av Time Machine-innstillingene.\n\n%@";
RESULTCODE_35_SHOWPREFS = "Hvis du vil ta i bruk Time Machine-innstillingene på nytt, åpner du Time Machine-valgpanelet og velger sikkerhetskopidisken på nytt.";

// BACKUP_FAILED_DESTINATION_COOKIE_NOT_FOUND
RESULTCODE_36_MESSAGE = "Time Machine fant ikke enkelte av Time Machine-innstillingene på sikkerhetskopidisken «%@».\n\nForsikre deg om at sikkerhetskopidisken er koblet til, og at andre disker som er koblet til, ikke har samme navn som sikkerhetskopidisken.\n\n%@";
RESULTCODE_36_SHOWPREFS = "Hvis du vil ta i bruk Time Machine-innstillingene igjen, åpner du Time Machine-valgpanelet og markerer sikkerhetskopidisken igjen.";

// BACKUP_FAILED_DISK_SOURCE_INTERRUPTION
RESULTCODE_37_MESSAGE = "En av diskene som sikkerhetskopieres, kan ha blitt matet ut eller koblet fra maskinen.";

// BACKUP_FAILED_TARGETIMAGE_READONLY
RESULTCODE_38_MESSAGE = "Time Machine kan ikke bruke diskfilen fordi den ikke kan skrives til.";

// BACKUP_HC_FAILED_TARGETVOL_RESOLUTION_FAILED
RESULTCODE_40_HEADER = "Time Machine kunne ikke verifisere sikkerhetskopiene fordi sikkerhetskopidisken ikke er tilgjengelig.";
RESULTCODE_40_MESSAGE = "Forsikre deg om at datamaskinen og sikkerhetskopidisken er på samme nettverk, og at sikkerhetskopidisken er slått på. Deretter prøver du å verifisere sikkerhetskopiene på nytt.";

// BACKUP_HC_FAILED_TARGETVOL_READONLY
RESULTCODE_41_HEADER = "Time Machine kunne ikke verifisere sikkerhetskopiene.";
RESULTCODE_41_MESSAGE = "Sikkerhetskopidisken ser ut til å være «kun les».";

// BACKUP_HC_VERIFICATION_INTERRUPTED
RESULTCODE_42_HEADER = "Time Machine kunne ikke verifisere sikkerhetskopiene fordi verifiseringen ble avbrutt.";
RESULTCODE_42_MESSAGE = "Forstyrrelser skyldes som regel nettverksproblemer. Prøv igjen når nettverksproblemene er løst.";

// BACKUP_FAILED_TO_ABANDON_IMAGE
RESULTCODE_43_MESSAGE = "Time Machine kunne ikke flytte bort sikkerhetskopidiskfilen «%@»";

// BACKUP_FAILED_TO_DELETE_IMAGE
RESULTCODE_44_MESSAGE = "Time Machine kunne ikke slette sikkerhetskopidiskfilen «%@»";

// BACKUP_FAILED_UNKNOWN
RESULTCODE_999_MESSAGE = "Feilkode: %@";

// BACKUP_WARNING_LOW_DISK_MESSAGE
RESULTCODE_1000_HEADER = "Sikkerhetskopidisken er nesten full.";
RESULTCODE_1000_MESSAGE = "Når sikkerhetskopidisken er full, sletter Time Machine gamle sikkerhetskopier for å frigjøre plass til nye.\n\n%@";
RESULTCODE_1000_SHOWPREFS = "Hvis du vil beholde de gamle sikkerhetskopiene, åpner du Time Machine-valgpanelet og velger en annen sikkerhetskopidisk.";

// BACKUP_WARNING_THINNING_START
RESULTCODE_1001_HEADER = "Sikkerhetskopidisken er full.";
RESULTCODE_1001_MESSAGE = "Time Machine har slettet en eller flere gamle sikkerhetskopier for å frigjøre plass for nye sikkerhetskopier. Den eldste sikkerhetskopien er nå: %@\n\n%@";
RESULTCODE_1001_SHOWPREFS = "Hvis du vil at det ikke skal slettes flere gamle sikkerhetskopier, åpner du Time Machine-valgpanelet og velger en annen sikkerhetskopidisk."; 
RESULTCODE_1001_CHECKBOX = "Ikke vis denne advarselen igjen.";

// BACKUP_WARNING_NO_RECENT_BACKUPS
RESULTCODE_1002_MESSAGE = "Time Machine har ikke sikkerhetskopiert maskinen på %@ dager.\n\n%@"; 
RESULTCODE_1002_SHOWPREFS = "Forsikre deg om at sikkerhetskopidisken er tilgjengelig, eller åpne Time Machine-valgpanelet for å velge en ny sikkerhetskopidisk.";

// BACKUP_WARNING_REUSE_BACKUPS
RESULTCODE_1003_HEADER = "Vil du bruke sikkerhetskopien «%@» på nytt med denne maskinen?";
RESULTCODE_1003_MESSAGE = "Sikkerhetskopien ble opprettet på en annen maskin. Hvis du bruker denne sikkerhetskopien på nytt, kan den ikke lenger brukes på den andre maskinen. ";
REUSE_BACKUP_BUTTON = "Bruk sikkerhetskopi på nytt";
CREATE_NEW_BACKUP_BUTTON = "Opprett ny sikkerhetskopi";
ASK_LATER_BUTTON = "Ikke sikkerhetskopier nå";

// BACKUP_WARNING_FIRMWARE 
RESULTCODE_1004_HEADER = "En oppdatering er tilgjengelig for «%@».";
RESULTCODE_1004_MESSAGE = "Denne oppdateringen forbedrer påliteligheten til Time Capsule. Åpne AirPort-verktøy for å installere oppdateringen. Det er mulig at du må oppgi Time Capsule-passordet for «%@».";
REMIND_LATER_BUTTON = "Oppdater senere";
AIRPORT_UTILITY_BUTTON = "Åpne AirPort-verktøy…";

// BACKUP_WARNING_DELETE_IMAGE 
RESULTCODE_1006_HEADER = "Time Machine har verifisert sikkerhetskopiene dine og må opprette en ny sikkerhetskopi for å forbedre påliteligheten.";
RESULTCODE_1006_MESSAGE = "Klikk på Start ny sikkerhetskopi hvis du vil opprette en ny sikkerhetskopi. Den eksisterende sikkerhetskopiloggen blir fjernet. Dette kan ta flere timer.\n\nKlikk på Sikkerhetskopier senere hvis du vil ha en påminnelse i morgen. Time Machine utfører ikke sikkerhetskopiering i mellomtiden.";
CREATE_RECOVERY_IMAGE_NOW_BUTTON = "Start ny sikkerhetskopi";
CREATE_RECOVERY_IMAGE_ASK_LATER_BUTTON = "Sikkerhetskopier senere";

// BACKUP_WARNING_TARGETVOL_CHANGED
RESULTCODE_1008_HEADER = "Identiteten til sikkerhetskopidisken er endret siden forrige sikkerhetskopiering.";
RESULTCODE_1008_MESSAGE = "Disken kan ha blitt erstattet eller slettet, eller det kan hende at noen prøver å få maskinen til å sikkerhetskopiere til feil disk.";
BACKUP_WARNING_TARGETVOL_CHANGED_OK_BUTTON = "Bruk denne disken";
BACKUP_WARNING_TARGETVOL_CHANGED_CANCEL_BUTTON = "Ikke sikkerhetskopier";

// UNITS
KB = "kB";
MB = "MB";
GB = "GB";
TB = "TB";
